# Реализовать консольное приложение заметки, с сохранением, чтением,
# добавлением, редактированием и удалением заметок. Заметка должна
# содержать идентификатор, заголовок, тело заметки и дату/время создания
# или последнего изменения заметки. Сохранение заметок необходимо сделать
# в формате json или csv формат (разделение полей рекомендуется делать через
# точку с запятой). Реализацию пользовательского интерфейса студент может
# делать как ему удобнее, можно делать как параметры запуска программы
# (команда, данные), можно делать как запрос команды с консоли и
# последующим вводом данных, как-то ещё, на усмотрение студента. 
# Например:
#   python notes.py add --title "новая заметка" –msg "тело новой заметки"
# Или так:
#   python note.py
#   Введите команду: add
#   Введите заголовок заметки: новая заметка
#   Введите тело заметки: тело новой заметки
#   Заметка успешно сохранена
#   Введите команду:
#
# При чтении списка заметок реализовать фильтрацию по дате

import datetime
import function as f

from pickle import TRUE
import os
    
while TRUE:
    os.system('cls') 
    print("Программа работы с заметками")
    print("1 - Создать новую заметку")
    print("2 - Отредактировать заметку")
    print("3 - Удалить заметку")
    print("4 - Выводим заметки списком")
    print("5 - Выводим заметки сортированным по дате списком")
    print("6 - Отфильтровать список по дате")
    print("7 - Выход")
    make = input("\nВыберите действие: ")

    match make:
        case "1":
            print("\nСоздаем новую заметку")
            title = input("Введите заголовок: ")
            text = input("Введите текст: ")
            id = f.read_id()
            f.note_add(title,text,int(id)+1)
            print("Заметка добавлена!")
            
        case "2":
            print("\nРедактируем заметку")
            f.notes_read()
            id = input("Введите id заметки: ")
            f.notes_del(id)
            title = input("Введите заголовок: ")
            text = input("Введите текст: ")
            f.note_add(title,text,id)
            print("Заметка заменена!")
            
        case "3":
            print("\nУдаляем заметку")
            f.notes_read()
            id = input("Введите id заметки: ")
            f.notes_del(id)
            print("Заметка удалена!")
        
        case "4":
            print("\nЗаметки списком")
            f.notes_read()
            
        case "5":
            print("\nЗаметки, отсортированные по дате")
            sort_col=3
            f.notes_read_sort(sort_col)
            
        case "6":
            date_f = 0 
            while date_f is 0:
                date_ = input("\nВведите дату для фильтра (ДД.ММ.ГГГГ): ")
                try:
                    date_f = datetime.datetime.strptime(date_, '%d.%m.%Y')
                    # print("Дата корректна", date_f)
                    f.filter_list(date_)
                except ValueError:
                    err = input("Введена некорректная дата. Введите 1, чтобы ввести ещё раз: ")
                    if err != "1": 
                        break

        case "7":
            print("Всего хорошего!")
            exit(0)
    input("\nДля продолжения нажмите <ENTER>...")